# Tap homebrew

tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'mas-cli/tap'

# Brew packages

brew 'node'
brew 'python'
brew 'gnu-sed'
brew 'zsh-autosuggestions' # Another really helpful zsh plugin.
brew 'zsh-syntax-highlighting' # A plugin for zsh to make your command line life much easier.
brew 'ncdu' # better disk usage visualisation
brew 'httpie' # Improved CURL command line tool
brew 'siege' # HTTP Concurrency test tool
brew 'ssh-copy-id' # Missing MacOS command to manage ssh keys
brew 'wget' # Download (get) remote data
brew 'openssl'
brew 'freetype'
brew 'mas' # Mac App Store apps managed by command line
brew 'gh'
brew 'z'
brew 'pkg-config', link: true
brew 'reattach-to-user-namespace'
brew 'tmate' # tmate is a fork of tmux that makes screen sharing friendlier.
brew 'vim' # Vim editor
brew 'curl', link: true
brew 'git'
brew 'git-flow'
brew 'make'
brew 'jq' # jq is a lightweight and flexible command-line JSON processor.
brew 'xsv' # xsv is for CSV file parsing, and is fast, full featured, and flexible.
brew 'nano'
brew 'bcrypt' # bcrypt is high quality encryption that is very popular
brew 'imagemagick'
brew 'theora'
brew 'monit' # Monit is for managing and monitoring Unix systems.
brew 'nmap' # nmap network mapper is a security scanner
brew 'htop' # Improved process manager
brew 'yadm' # I use this to manage my dotfiles
brew 'asciinema' # Record what you do in a terminal!

# Quick Look Improvements

cask 'apparency' # Quicklook MacApp content
cask 'betterzip' # Preview ZIP archives
cask 'provisionql' # Preview iOS / macOS app and provision information
cask 'quicklookapk' # Preview Android APK files
cask 'quicklook-pat' # Preview Adobe Photoshop pattern files
cask 'qlcolorcode' # colored code on quick view
cask 'qlstephen' # Preview plain text files without or with unknown file extension. Example: README, CHANGELOG, index.styl, etc.
cask 'qlmarkdown' # markdown quick view
cask 'quicklook-json' # JSON quick view
cask 'qlimagesize' # image size for quick view
cask 'quicklookase' # Preview Adobe ASE Color Swatches
cask 'qlvideo' # Preview most types of video files, as well as their thumbnails, cover art and metadata
cask 'suspicious-package' # Preview the contents of a standard Apple installer package
cask 'webpquicklook' # Webp quick view


# Cask Apps

cask 'font-cascadia-code' # better source code font
cask 'font-fira-code' # better source code font
cask '1password'
cask 'brave-browser'
cask 'google-chrome'
cask 'firefox'
cask 'dropbox'
cask 'google-drive'
cask 'iina' # Video player for mac with wide file support.
cask 'visual-studio-code' # Open source Code Editor
cask 'discord' # Discord chat
cask 'telegram' # Telegram chat
cask 'whatsapp' # Whatsapp chat
cask 'notion' # Better notes manager with markdown support.
cask 'camo-studio' # To use your iPhone as camera on Mac
cask 'zoom' # online meetings
cask 'flux' # Flux dims the screen colors for better nighttime visibility.
cask 'spotify' # online music
cask 'appcleaner' # AppCleaner thoroughly uninstalls unwanted apps.
cask 'charles' # Charles: enables a developer to view HTTP traffic.
cask 'authy' # OTP/multi-factor authentication.
cask 'cakebrew' # A GUI in front of Homebrew.
cask 'krisp' # Noise cancellation, in case you are taking a Zoom call in a noisy area.
cask 'maccy' # Clipboard manager. Alternative to Paste
cask 'pika' # Color picker manager.
cask 'fantastical' # Calendar Manager.
cask 'vox' # Complete Music Player.
cask 'nordvpn' # VPN Service
